# Getting Started SQL for Data Science

* practice basic sql command
- create table
- insert data
- select data
- update data
- delete data

# Select statement

- retrieve data from table using select statement

- select is dml statement (data manipulation language)
- always required to use where clause to filter data

- Example: select * from table_name where column_name = value
- Example: select column_name from table_name where column_name = value
- Example: select column_name from table_name where column_name = value and column_name = value

## Hands-on Lab : Basics of SQL SELECT Statement

In this lab, you will learn one of the most commonly used statements of SQL (Structured Query Language), the SELECT statement. The SELECT statement is used to select data from a database.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition
;
```

In [3]:
# SELECT * FROM FilmLocations;

# These are the columns attributes of the table

```txt
FilmLocations(
    Title:              titles of the films, 
    ReleaseYear:        time of public release of the films, 
    Locations:          locations of San Francisco where the films were shot, 
    FunFacts:           funny facts about the filming locations, 
    ProductionCompany:  companies who produced the films, 
    Distributor:        companies who distributed the films, 
    Director:           people who directed the films, 
    Writer:             people who wrote the films, 
    Actor1:             person 1 who acted in the films, 
    Actor2:             person 2 who acted in the films, 
    Actor3:             person 3 who acted in the films
)
```

- we want to retrieve film names along with filming locations and release years. But we also want to restrict the output resultset so that we can retrieve only the film records released in 2001 and onwards (release years after 2001 including 2001).

In [4]:
# SELECT Title, ReleaseYear, Locations FROM FilmLocations WHERE ReleaseYear>=2001;

- Retrieve the names, production company names, filming locations, and release years of the films which are not written by James Cameron.

In [5]:
# SELECT Title, ProductionCompany, Locations, ReleaseYear FROM FilmLocations WHERE Writer<> "James Cameron";

# COUNT, DISTINCT, LIMIT

- count: count the number of rows in a table
- distinct: count the number of distinct values in a column
- limit: limit the number of rows in a result set

- count is dql statement (data query language)
- count a built-in function in sql language that counts the number of rows in a table.

```sql
SELECT COUNT(*) FROM table_name;
```
or 
```sql
SELECT COUNT(*) FROM table_name WHERE condition;
```
or
```sql
SELECT COUNT(name_table) FROM table_name WHERE condition1 AND condition2;
```

- DISCTINCT is dql statement (data query language)
- distinct is a built-in function in sql language that counts the number of distinct values in a column.

```sql
SELECT DISTINCT column_name FROM table_name;
```
or 
```sql
SELECT DISTINCT column_name FROM table_name WHERE condition;
```
or
```sql
SELECT DISTINCT column_name FROM table_name WHERE condition1 AND condition2;
```

- LIMIT is dql statement (data query language)
- limit is a built-in function in sql language that limits the number of rows in a result set.

```sql
SELECT * FROM table_name LIMIT number_of_rows;
```
or 
```sql
SELECT * FROM table_name WHERE condition LIMIT number_of_rows;
```
or
```sql
SELECT * FROM table_name WHERE condition1 AND condition2 LIMIT number_of_rows;
```

# FULL EXAMPLE
    
```sql
SELECT DISTINCT(TITLE) FROM FilmLocations WHERE ReleaseYear = 2015  LIMIT 3 OFFSET 5;
```

## Create the table (CREATE TABLE statement)
  - Populate table with data:
    - INSERT statement
       ```txt
       a Data Manipulation Language (DML) statement used to read
       and modify data
       ```

```sql
INSERT INTO [TableName]
    <(ColumnName),,..)>
VALUES ([Value],...)
```

# UPDATE & DELETE Statements
At the end of this lesson, you will be able to:
   * Identify the syntax of the UPDATE statement
   * Identify the syntax of the DELETE statement
   * Explain the importance of the WHERE clause in both the UPDATE
   and DELETE statements

```sql
UPDATE [TableName]
SET [[ColumnName]=[Value]]
<WHERE [Condition]>
```

In [9]:
# UPDATE USER SET LAST_NAME = "Smith"  FIRST_NAME = 'Romero' WHERE USER_ID = "1";

# Deleting Rows from a table
  Remove 1 or more rows from the table:

  ## DELETE statement
    A DML statement used to read and modify data

```sql
DELETE FROM [TableName]
<WHERE [Condition]>
```

# DELETE FROM USER TABLE

```sql
DELETE FROM USER WHERE USER_ID IN (1,2,3);
```

# How does the syntax of an INSERT statement look?
```SQL
INSERT INTO table_name (column1, column2, ... )
VALUES (value1, value2, ... )
;
```

# How does the syntax of an UPDATE statement look?
```SQL	
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition
;
```

# How does the syntax of a DELETE statement look?
```SQL
DELETE FROM table_name
WHERE condition
;
```

```txt
Instructor (
    ins_id:     unique identification number of the instructors,    
    lastname:   last name of the instructors,
    firstname:  first name of the instructors,
    city:       name of the cities where instructors are located,
    country:    two-letter country code of the countries where instructors are located
)
```

# INSERT

```SQL
INSERT INTO Instructor(INS_ID, LASTNAME, FIRSTNAME, CITY, COUNTRY) VALUES(7,'Cangiano', 'Antonio','Vancouver', 'CA');
```

```SQL
INSERT INTO Instructor(INS_ID, LASTNAME, FIRSTNAME, CITY, COUNTRY) VALUES
    (8,'Ryan', 'Steve','Barlby', 'GB'), 
    (9,'Sannareddy', 'Ramesh','Hyderabad', 'IN');
    
SELECT  * FROM  instructor;
```

# UPDATE
    
```sql
UPDATE Instructor
SET city= 'Markham', country='BD'
WHERE INS_ID=4;

SELECT * FROM Instructor;
```

# DELETE

```sql
DELETE FROM INSTRUCTOR 
WHERE FIRSTNAME='Hima';


SELECT * FROM INSTRUCTOR;
```

## Congratulations! You have completed this lesson. At this point in the course, you know: 

* You can use Data Manipulation Language (DML) statements to read and modify data. 

* The search condition of the WHERE clause uses a predicate to refine the search.​ 

* COUNT, DISTINCT, and LIMIT​ are expressions that are used with SELECT statements​. 

* INSERT, UPDATE, and DELETE are DML statements for populating and changing tables.